---
kind: property
id: P:Autodesk.Revit.DB.ScheduleDefinition.ShowGridLines
source: html/ee129ffc-8e0b-144c-5e23-0069ab7c6bed.htm
---
# Autodesk.Revit.DB.ScheduleDefinition.ShowGridLines Property

Indicates if the schedule grid lines will be visible on a sheet.

## Syntax (C#)
```csharp
public bool ShowGridLines { get; set; }
```